#include<stdio.h>

int main()
{
    //自增自减运算符！++，--，一个加1，一个减1
    int a = 10;
    a++;//11
    a--;//10
    ++a;//11
    --a;//10
    printf("最终a = %d\n",a);
    //参与计算时，先++与后++就有区别了
    {
    int c = 12;
    int d = c++;//先用后加，d为12
    int e = ++c;//先加后用，e为13
    printf("d = %d\ne = %d\n",d,e);
    }
    /*
    windows:前缀优先于后缀
    前缀统一进行自增自减，再把结果拿出来用
    int i = 10;
    ++i + ++i;
    12  +  12 = 24;
    后缀则统一一起结算
    i++ + i++;
    10  +  10 = 20;
    最终i变为12
    linux,mac:前后缀优先级一致
    ++i + ++i;
    11  +  12 = 23;
    又如i++ + ++i;
        10  + 12;
    */
    {
        int i = 10;
        int j = 5;
        int k = i++ + ++i - --j - i--;
        //实则为 11    11    4     11 ，最终i为11
        printf("k = %d\n",k);
    }
    {
        //别被阴了！
        
        int k1 = a++ + a++ + a;
        int k2 = ++a + ++a;
        int k3 = ++a + a++;
        int k4 = a++ + ++a;
        printf("k1 = %d\nk2 = %d\nk3 = %d\nk4 = %d\n",k1,k2,k3,k4);
        //++这玩意儿可是会积累的！
        //第一个中，a还没到后缀发力的时候！
    }
    return 0;
    //哎，这玩意儿其实正经工作上几乎用不到
}    
